package variable;

/*
	형변환 : 자료형을 변환하는 방법
	1. 자동 형변환 : 서로 다른 타입을 연산시 발생
	2. 강제 형변환 : 개발자가 지정한 타입으로 변경
	
	※ 강제 형변환은 변수를 배워야 할 수 있음
*/

public class Ex02 {
	public static void main(String[] args) {
		// 문자열 + 문자열 (= 타입 일치, 자동 형변환x)
		System.out.println("10" + "5");
		
		// 문자열 + 정수 (= 타입 불일치, 자동 형변환 발생)
		// 1. "10" + 5 		타입이 달라서 연산 불가능
		// 2. "10" + "5"	그럼 타입을 맞추면 되잖아? 정수(5) -> 문자열("5")
		// 3. "105"			※ 표현 범위가 큰 쪽으로 변경이 된다
		System.out.println("10" + 5);
		
		// 정수 + 실수
		// 1. 10 + 3.2		타입 불일치. 연산 불가
		// 2. 10.0 + 3.2	10 -> 10.0으로 변환
		// 3. 13.2
		System.out.println(10 + 3.2);
		
		// 결론)
		// 사실 자동 형변환은 정수, 실수의 자연스러운 연산을 위해 고안됨
	}
}
